tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# YAML Parser
brew "libyaml"
# Shell-agnostic version manager (asdf rust alternative)
brew "mise"
# High performance key/value database
brew "berkeley-db", link: true
# Parser generator
brew "bison"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GNU database manager
brew "gdbm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# Text processing system for reStructuredText
brew "docutils"
# Highly capable, feature-rich programming language
brew "perl"
# Debian package management system
brew "dpkg"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Portable Foreign Function Interface library
brew "libffi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Database of common MIME types
brew "shared-mime-info"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library access to GnuPG
brew "gpgme"
# Image processing tools collection
brew "graphicsmagick"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Conversion library
brew "libiconv"
# Open source relational database management system
brew "mysql@5.7", link: true
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Python version management
brew "pyenv"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Collection of tools for managing UNIX services
brew "runit"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Terraform
brew "hashicorp/tap/terraform"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Web browser
cask "google-chrome"
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "asuka.insertnumbers"
vscode "chunsen.bracket-select"
vscode "codestream.codestream"
vscode "codezombiech.gitignore"
vscode "cssho.vscode-svgviewer"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hollowtree.vue-snippets"
vscode "htmlhint.vscode-htmlhint"
vscode "karunamurti.haml"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "octref.vetur"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
